
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	

	
КонецПроцедуры



&НаКлиенте
Процедура ПриСозданииНаКлиенте(Отказ) Экспорт
	
	// привязываем обработчик к полю «СогласованнаяСкидка»
	ПолеСкидка = Элементы.Найти("СогласованнаяСкидка");
	Если ПолеСкидка <> Неопределено Тогда
		ПолеСкидка.ИмяОбработчикаСобытия["ПриИзменении"] = "СогласованнаяСкидкаПриИзменении";
	КонецЕсли;
	
	// стандартное обновление команд
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	
КонецПроцедуры



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
КонецПроцедуры



&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры



&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры
#КонецОбласти


 

#Область ЛогикаСогласованнойСкидки
//Доработки Трошин Андрей 
&НаКлиенте
Асинх Процедура СогласованнаяСкидкаПриИзменении(Элемент, НовоеЗначение, СтандартнаяОбработка)
	
	// если обе ТЧ пустые – выходим
	Если Объект.Товары.Количество() = 0
		И Объект.Услуги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;  
	
		//Ограничеваем скидку
	Если Объект.СогласованнаяСкидка > 100 Тогда
		Объект.СогласованнаяСкидка = 100;
		Сообщить ("Вы попытались ввести скидку больше 100%, скидка установлена в занчение 100%");
	КонецЕсли;
	
	// асинх-вопрос
	Ответ = Ждать ВопросАсинх("Изменён процент скидки. Пересчитать строки?",РежимДиалогаВопрос.ДаНет);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПересчитатьВсеСтроки();
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура НетПрименитьСкидку(Команда)
	ПересчитатьВсеСтроки();
КонецПроцедуры



&НаКлиенте
Процедура ПересчитатьВсеСтроки()
	
	ПересчитатьТаблицу(Объект.Товары);
	ПересчитатьТаблицу(Объект.Услуги);
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры



&НаКлиенте
Процедура ПересчитатьТаблицу(ТаблицаДетализации)
	
	Для Каждого Стр Из ТаблицаДетализации Цикл
		Стр.Сумма = Окр(Стр.Количество * (Стр.Цена - Стр.Цена * Объект.СогласованнаяСкидка / 100), 2);
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиТаблицТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РассчитатьСуммуСтроки(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры



&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РассчитатьСуммуСтроки(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры



&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиТаблицУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	РассчитатьСуммуСтроки(Элементы.Услуги.ТекущиеДанные);
КонецПроцедуры



&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	РассчитатьСуммуСтроки(Элементы.Услуги.ТекущиеДанные);
КонецПроцедуры



&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры
#КонецОбласти



#Область ПодсчётСумм

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	ТекущиеДанные.Сумма = Окр(ТекущиеДанные.Количество * (ТекущиеДанные.Цена - ТекущиеДанные.Цена * Объект.СогласованнаяСкидка / 100), 2);
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры



&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры
#КонецОбласти



#Область ПодключаемыеКоманды
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
#КонецОбласти
