//  Общий модуль  ―  Нет_ЗаказПокупателя

#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаПраво(Форма);
		ДобавитьКнопкуВГруппаШапкаПраво(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти



#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	ПолеВвода = Форма.Элементы.Добавить("КонтактныеЛица",Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид        = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.НетКонтактноеЛицо";
КонецПроцедуры


Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	ПолеВвода = Форма.Элементы.Вставить("КонтактныеЛица",Тип("ПолеФормы") );
	ПолеВвода.Вид        = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.НетКонтактноеЛицо";
КонецПроцедуры


Процедура ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаПраво(Форма)
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка",Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид        = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении");
КонецПроцедуры


Процедура ДобавитьКнопкуВГруппаШапкаПраво(Форма)
	
	// 1. Команда
	Команда = Форма.Команды.Добавить("НетПрименитьСкидку");
	Команда.Действие  = "НетПрименитьСкидку"; // процедура формы
	Команда.Заголовок = "Применить скидку";
	
	// 2. Кнопка
	Кнопка = Форма.Элементы.Добавить("НетПрименитьСкидку",Тип("КнопкаФормы"),Форма.Элементы.ГруппаШапкаПраво);
	
	Кнопка.ИмяКоманды = "НетПрименитьСкидку";
	Кнопка.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	
КонецПроцедуры

#КонецОбласти
